; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.13.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.pqueue_t = type { i64, i64, i64, i32 (i64, i64)*, i64 (i8*)*, void (i8*, i64)*, i64 (i8*)*, void (i8*, i64)*, i8** }
%struct.node_t = type { i64, i32, i64 }

@__stdoutp = external global %struct.__sFILE*, align 8
@.str = private unnamed_addr constant [37 x i8] c"posn\09left\09right\09parent\09maxchild\09...\0A\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"%d\09%d\09%d\09%d\09%ul\09\00", align 1
@.str.3 = private unnamed_addr constant [17 x i8] c"peek: %lld [%d]\0A\00", align 1
@.str.1.4 = private unnamed_addr constant [16 x i8] c"pop: %lld [%d]\0A\00", align 1

; Function Attrs: nounwind ssp uwtable
define %struct.pqueue_t* @pqueue_init(i64, i32 (i64, i64)*, i64 (i8*)*, void (i8*, i64)*, i64 (i8*)*, void (i8*, i64)*) #0 !dbg !29 {
  %7 = alloca %struct.pqueue_t*, align 8
  %8 = alloca i64, align 8
  %9 = alloca i32 (i64, i64)*, align 8
  %10 = alloca i64 (i8*)*, align 8
  %11 = alloca void (i8*, i64)*, align 8
  %12 = alloca i64 (i8*)*, align 8
  %13 = alloca void (i8*, i64)*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "pqueue.c", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !7, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !8)
!7 = !DIFile(filename: "sample.c", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "node_t", file: !7, line: 43, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "node_t", file: !7, line: 38, size: 192, align: 64, elements: !12)
!12 = !{!13, !17, !19}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "pri", scope: !11, file: !7, line: 40, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_pri_t", file: !15, line: 39, baseType: !16)
!15 = !DIFile(filename: "./pqueue.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!16 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !11, file: !7, line: 41, baseType: !18, size: 32, align: 32, offset: 64)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !11, file: !7, line: 42, baseType: !20, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !23, line: 92, baseType: !24)
!23 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!24 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!25 = !{!"clang version 3.9.1 (tags/RELEASE_391/final)"}
!26 = !{i32 2, !"Dwarf Version", i32 2}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 1, !"PIC Level", i32 2}
!29 = distinct !DISubprogram(name: "pqueue_init", scope: !1, file: !1, line: 40, type: !30, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !20, !40, !45, !50, !55, !60}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_t", file: !15, line: 68, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pqueue_t", file: !15, line: 57, size: 576, align: 64, elements: !35)
!35 = !{!36, !37, !38, !39, !44, !49, !54, !59, !64}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !34, file: !15, line: 59, baseType: !20, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !34, file: !15, line: 60, baseType: !20, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !34, file: !15, line: 61, baseType: !20, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cmppri", scope: !34, file: !15, line: 62, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_cmp_pri_f", file: !15, line: 44, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!18, !14, !14}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "getpri", scope: !34, file: !15, line: 63, baseType: !45, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_get_pri_f", file: !15, line: 42, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!14, !4}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "setpri", scope: !34, file: !15, line: 64, baseType: !50, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_set_pri_f", file: !15, line: 43, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !4, !14}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "getpos", scope: !34, file: !15, line: 65, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_get_pos_f", file: !15, line: 48, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!20, !4}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "setpos", scope: !34, file: !15, line: 66, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_set_pos_f", file: !15, line: 49, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !4, !20}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !34, file: !15, line: 67, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!66 = !DILocalVariable(name: "n", arg: 1, scope: !29, file: !1, line: 40, type: !20)
!67 = !DIExpression()
!68 = !DILocation(line: 40, column: 20, scope: !29)
!69 = !DILocalVariable(name: "cmppri", arg: 2, scope: !29, file: !1, line: 41, type: !40)
!70 = !DILocation(line: 41, column: 30, scope: !29)
!71 = !DILocalVariable(name: "getpri", arg: 3, scope: !29, file: !1, line: 42, type: !45)
!72 = !DILocation(line: 42, column: 30, scope: !29)
!73 = !DILocalVariable(name: "setpri", arg: 4, scope: !29, file: !1, line: 43, type: !50)
!74 = !DILocation(line: 43, column: 30, scope: !29)
!75 = !DILocalVariable(name: "getpos", arg: 5, scope: !29, file: !1, line: 44, type: !55)
!76 = !DILocation(line: 44, column: 30, scope: !29)
!77 = !DILocalVariable(name: "setpos", arg: 6, scope: !29, file: !1, line: 45, type: !60)
!78 = !DILocation(line: 45, column: 30, scope: !29)
!79 = !DILocalVariable(name: "q", scope: !29, file: !1, line: 47, type: !32)
!80 = !DILocation(line: 47, column: 15, scope: !29)
!81 = !DILocation(line: 49, column: 15, scope: !82)
!82 = distinct !DILexicalBlock(scope: !29, file: !1, line: 49, column: 9)
!83 = !DILocation(line: 49, column: 13, scope: !82)
!84 = !DILocation(line: 49, column: 9, scope: !29)
!85 = !DILocation(line: 50, column: 9, scope: !82)
!86 = !DILocation(line: 53, column: 26, scope: !87)
!87 = distinct !DILexicalBlock(scope: !29, file: !1, line: 53, column: 9)
!88 = !DILocation(line: 53, column: 28, scope: !87)
!89 = !DILocation(line: 53, column: 33, scope: !87)
!90 = !DILocation(line: 53, column: 18, scope: !87)
!91 = !DILocation(line: 53, column: 11, scope: !87)
!92 = !DILocation(line: 53, column: 14, scope: !87)
!93 = !DILocation(line: 53, column: 16, scope: !87)
!94 = !DILocation(line: 53, column: 9, scope: !29)
!95 = !DILocation(line: 54, column: 14, scope: !96)
!96 = distinct !DILexicalBlock(scope: !87, file: !1, line: 53, column: 53)
!97 = !DILocation(line: 54, column: 9, scope: !96)
!98 = !DILocation(line: 55, column: 9, scope: !96)
!99 = !DILocation(line: 58, column: 5, scope: !29)
!100 = !DILocation(line: 58, column: 8, scope: !29)
!101 = !DILocation(line: 58, column: 13, scope: !29)
!102 = !DILocation(line: 59, column: 27, scope: !29)
!103 = !DILocation(line: 59, column: 28, scope: !29)
!104 = !DILocation(line: 59, column: 16, scope: !29)
!105 = !DILocation(line: 59, column: 19, scope: !29)
!106 = !DILocation(line: 59, column: 24, scope: !29)
!107 = !DILocation(line: 59, column: 5, scope: !29)
!108 = !DILocation(line: 59, column: 8, scope: !29)
!109 = !DILocation(line: 59, column: 14, scope: !29)
!110 = !DILocation(line: 60, column: 17, scope: !29)
!111 = !DILocation(line: 60, column: 5, scope: !29)
!112 = !DILocation(line: 60, column: 8, scope: !29)
!113 = !DILocation(line: 60, column: 15, scope: !29)
!114 = !DILocation(line: 61, column: 17, scope: !29)
!115 = !DILocation(line: 61, column: 5, scope: !29)
!116 = !DILocation(line: 61, column: 8, scope: !29)
!117 = !DILocation(line: 61, column: 15, scope: !29)
!118 = !DILocation(line: 62, column: 17, scope: !29)
!119 = !DILocation(line: 62, column: 5, scope: !29)
!120 = !DILocation(line: 62, column: 8, scope: !29)
!121 = !DILocation(line: 62, column: 15, scope: !29)
!122 = !DILocation(line: 63, column: 17, scope: !29)
!123 = !DILocation(line: 63, column: 5, scope: !29)
!124 = !DILocation(line: 63, column: 8, scope: !29)
!125 = !DILocation(line: 63, column: 15, scope: !29)
!126 = !DILocation(line: 64, column: 17, scope: !29)
!127 = !DILocation(line: 64, column: 5, scope: !29)
!128 = !DILocation(line: 64, column: 8, scope: !29)
!129 = !DILocation(line: 64, column: 15, scope: !29)
!130 = !DILocation(line: 66, column: 12, scope: !29)
!131 = !DILocation(line: 66, column: 5, scope: !29)
!132 = !DILocation(line: 67, column: 1, scope: !29)
!133 = distinct !DISubprogram(name: "pqueue_free", scope: !1, file: !1, line: 71, type: !134, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !32}
!136 = !DILocalVariable(name: "q", arg: 1, scope: !133, file: !1, line: 71, type: !32)
!137 = !DILocation(line: 71, column: 23, scope: !133)
!138 = !DILocation(line: 73, column: 10, scope: !133)
!139 = !DILocation(line: 73, column: 13, scope: !133)
!140 = !DILocation(line: 73, column: 5, scope: !133)
!141 = !DILocation(line: 74, column: 10, scope: !133)
!142 = !DILocation(line: 74, column: 5, scope: !133)
!143 = !DILocation(line: 75, column: 1, scope: !133)
!144 = distinct !DISubprogram(name: "pqueue_size", scope: !1, file: !1, line: 79, type: !145, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!145 = !DISubroutineType(types: !146)
!146 = !{!20, !32}
!147 = !DILocalVariable(name: "q", arg: 1, scope: !144, file: !1, line: 79, type: !32)
!148 = !DILocation(line: 79, column: 23, scope: !144)
!149 = !DILocation(line: 82, column: 13, scope: !144)
!150 = !DILocation(line: 82, column: 16, scope: !144)
!151 = !DILocation(line: 82, column: 21, scope: !144)
!152 = !DILocation(line: 82, column: 5, scope: !144)
!153 = distinct !DISubprogram(name: "pqueue_insert", scope: !1, file: !1, line: 143, type: !154, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!154 = !DISubroutineType(types: !155)
!155 = !{!18, !32, !4}
!156 = !DILocalVariable(name: "q", arg: 1, scope: !153, file: !1, line: 143, type: !32)
!157 = !DILocation(line: 143, column: 25, scope: !153)
!158 = !DILocalVariable(name: "d", arg: 2, scope: !153, file: !1, line: 143, type: !4)
!159 = !DILocation(line: 143, column: 34, scope: !153)
!160 = !DILocalVariable(name: "tmp", scope: !153, file: !1, line: 145, type: !4)
!161 = !DILocation(line: 145, column: 11, scope: !153)
!162 = !DILocalVariable(name: "i", scope: !153, file: !1, line: 146, type: !20)
!163 = !DILocation(line: 146, column: 12, scope: !153)
!164 = !DILocalVariable(name: "newsize", scope: !153, file: !1, line: 147, type: !20)
!165 = !DILocation(line: 147, column: 12, scope: !153)
!166 = !DILocation(line: 149, column: 10, scope: !167)
!167 = distinct !DILexicalBlock(scope: !153, file: !1, line: 149, column: 9)
!168 = !DILocation(line: 149, column: 9, scope: !153)
!169 = !DILocation(line: 149, column: 13, scope: !167)
!170 = !DILocation(line: 152, column: 9, scope: !171)
!171 = distinct !DILexicalBlock(scope: !153, file: !1, line: 152, column: 9)
!172 = !DILocation(line: 152, column: 12, scope: !171)
!173 = !DILocation(line: 152, column: 20, scope: !171)
!174 = !DILocation(line: 152, column: 23, scope: !171)
!175 = !DILocation(line: 152, column: 17, scope: !171)
!176 = !DILocation(line: 152, column: 9, scope: !153)
!177 = !DILocation(line: 153, column: 19, scope: !178)
!178 = distinct !DILexicalBlock(scope: !171, file: !1, line: 152, column: 30)
!179 = !DILocation(line: 153, column: 22, scope: !178)
!180 = !DILocation(line: 153, column: 29, scope: !178)
!181 = !DILocation(line: 153, column: 32, scope: !178)
!182 = !DILocation(line: 153, column: 27, scope: !178)
!183 = !DILocation(line: 153, column: 17, scope: !178)
!184 = !DILocation(line: 154, column: 29, scope: !185)
!185 = distinct !DILexicalBlock(scope: !178, file: !1, line: 154, column: 13)
!186 = !DILocation(line: 154, column: 32, scope: !185)
!187 = !DILocation(line: 154, column: 52, scope: !185)
!188 = !DILocation(line: 154, column: 50, scope: !185)
!189 = !DILocation(line: 154, column: 21, scope: !185)
!190 = !DILocation(line: 154, column: 19, scope: !185)
!191 = !DILocation(line: 154, column: 13, scope: !178)
!192 = !DILocation(line: 155, column: 13, scope: !185)
!193 = !DILocation(line: 156, column: 16, scope: !178)
!194 = !DILocation(line: 156, column: 9, scope: !178)
!195 = !DILocation(line: 156, column: 12, scope: !178)
!196 = !DILocation(line: 156, column: 14, scope: !178)
!197 = !DILocation(line: 157, column: 20, scope: !178)
!198 = !DILocation(line: 157, column: 9, scope: !178)
!199 = !DILocation(line: 157, column: 12, scope: !178)
!200 = !DILocation(line: 157, column: 18, scope: !178)
!201 = !DILocation(line: 158, column: 5, scope: !178)
!202 = !DILocation(line: 161, column: 9, scope: !153)
!203 = !DILocation(line: 161, column: 12, scope: !153)
!204 = !DILocation(line: 161, column: 16, scope: !153)
!205 = !DILocation(line: 161, column: 7, scope: !153)
!206 = !DILocation(line: 162, column: 15, scope: !153)
!207 = !DILocation(line: 162, column: 10, scope: !153)
!208 = !DILocation(line: 162, column: 5, scope: !153)
!209 = !DILocation(line: 162, column: 8, scope: !153)
!210 = !DILocation(line: 162, column: 13, scope: !153)
!211 = !DILocation(line: 163, column: 15, scope: !153)
!212 = !DILocation(line: 163, column: 18, scope: !153)
!213 = !DILocation(line: 163, column: 5, scope: !153)
!214 = !DILocation(line: 165, column: 5, scope: !153)
!215 = !DILocation(line: 166, column: 1, scope: !153)
!216 = distinct !DISubprogram(name: "bubble_up", scope: !1, file: !1, line: 87, type: !217, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !32, !20}
!219 = !DILocalVariable(name: "q", arg: 1, scope: !216, file: !1, line: 87, type: !32)
!220 = !DILocation(line: 87, column: 21, scope: !216)
!221 = !DILocalVariable(name: "i", arg: 2, scope: !216, file: !1, line: 87, type: !20)
!222 = !DILocation(line: 87, column: 31, scope: !216)
!223 = !DILocalVariable(name: "parent_node", scope: !216, file: !1, line: 89, type: !20)
!224 = !DILocation(line: 89, column: 12, scope: !216)
!225 = !DILocalVariable(name: "moving_node", scope: !216, file: !1, line: 90, type: !4)
!226 = !DILocation(line: 90, column: 11, scope: !216)
!227 = !DILocation(line: 90, column: 30, scope: !216)
!228 = !DILocation(line: 90, column: 25, scope: !216)
!229 = !DILocation(line: 90, column: 28, scope: !216)
!230 = !DILocalVariable(name: "moving_pri", scope: !216, file: !1, line: 91, type: !14)
!231 = !DILocation(line: 91, column: 18, scope: !216)
!232 = !DILocation(line: 91, column: 31, scope: !216)
!233 = !DILocation(line: 91, column: 34, scope: !216)
!234 = !DILocation(line: 91, column: 41, scope: !216)
!235 = !DILocation(line: 93, column: 24, scope: !236)
!236 = distinct !DILexicalBlock(scope: !216, file: !1, line: 93, column: 5)
!237 = !DILocation(line: 93, column: 22, scope: !236)
!238 = !DILocation(line: 93, column: 10, scope: !236)
!239 = !DILocation(line: 94, column: 12, scope: !240)
!240 = distinct !DILexicalBlock(scope: !236, file: !1, line: 93, column: 5)
!241 = !DILocation(line: 94, column: 14, scope: !240)
!242 = !DILocation(line: 94, column: 19, scope: !240)
!243 = !DILocation(line: 94, column: 22, scope: !240)
!244 = !DILocation(line: 94, column: 25, scope: !240)
!245 = !DILocation(line: 94, column: 32, scope: !240)
!246 = !DILocation(line: 94, column: 35, scope: !240)
!247 = !DILocation(line: 94, column: 47, scope: !240)
!248 = !DILocation(line: 94, column: 42, scope: !240)
!249 = !DILocation(line: 94, column: 45, scope: !240)
!250 = !DILocation(line: 94, column: 62, scope: !240)
!251 = !DILocation(line: 93, column: 5, scope: !236)
!252 = !DILocation(line: 97, column: 24, scope: !253)
!253 = distinct !DILexicalBlock(scope: !240, file: !1, line: 96, column: 5)
!254 = !DILocation(line: 97, column: 19, scope: !253)
!255 = !DILocation(line: 97, column: 22, scope: !253)
!256 = !DILocation(line: 97, column: 14, scope: !253)
!257 = !DILocation(line: 97, column: 9, scope: !253)
!258 = !DILocation(line: 97, column: 12, scope: !253)
!259 = !DILocation(line: 97, column: 17, scope: !253)
!260 = !DILocation(line: 98, column: 9, scope: !253)
!261 = !DILocation(line: 98, column: 12, scope: !253)
!262 = !DILocation(line: 98, column: 24, scope: !253)
!263 = !DILocation(line: 98, column: 19, scope: !253)
!264 = !DILocation(line: 98, column: 22, scope: !253)
!265 = !DILocation(line: 98, column: 28, scope: !253)
!266 = !DILocation(line: 99, column: 5, scope: !253)
!267 = !DILocation(line: 95, column: 14, scope: !240)
!268 = !DILocation(line: 95, column: 12, scope: !240)
!269 = !DILocation(line: 95, column: 41, scope: !240)
!270 = !DILocation(line: 95, column: 39, scope: !240)
!271 = !DILocation(line: 93, column: 5, scope: !240)
!272 = distinct !{!272, !273}
!273 = !DILocation(line: 93, column: 5, scope: !216)
!274 = !DILocation(line: 101, column: 15, scope: !216)
!275 = !DILocation(line: 101, column: 10, scope: !216)
!276 = !DILocation(line: 101, column: 5, scope: !216)
!277 = !DILocation(line: 101, column: 8, scope: !216)
!278 = !DILocation(line: 101, column: 13, scope: !216)
!279 = !DILocation(line: 102, column: 5, scope: !216)
!280 = !DILocation(line: 102, column: 8, scope: !216)
!281 = !DILocation(line: 102, column: 15, scope: !216)
!282 = !DILocation(line: 102, column: 28, scope: !216)
!283 = !DILocation(line: 103, column: 1, scope: !216)
!284 = distinct !DISubprogram(name: "pqueue_change_priority", scope: !1, file: !1, line: 170, type: !285, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !32, !14, !4}
!287 = !DILocalVariable(name: "q", arg: 1, scope: !284, file: !1, line: 170, type: !32)
!288 = !DILocation(line: 170, column: 34, scope: !284)
!289 = !DILocalVariable(name: "new_pri", arg: 2, scope: !284, file: !1, line: 171, type: !14)
!290 = !DILocation(line: 171, column: 37, scope: !284)
!291 = !DILocalVariable(name: "d", arg: 3, scope: !284, file: !1, line: 172, type: !4)
!292 = !DILocation(line: 172, column: 30, scope: !284)
!293 = !DILocalVariable(name: "posn", scope: !284, file: !1, line: 174, type: !20)
!294 = !DILocation(line: 174, column: 12, scope: !284)
!295 = !DILocalVariable(name: "old_pri", scope: !284, file: !1, line: 175, type: !14)
!296 = !DILocation(line: 175, column: 18, scope: !284)
!297 = !DILocation(line: 175, column: 28, scope: !284)
!298 = !DILocation(line: 175, column: 31, scope: !284)
!299 = !DILocation(line: 175, column: 38, scope: !284)
!300 = !DILocation(line: 177, column: 5, scope: !284)
!301 = !DILocation(line: 177, column: 8, scope: !284)
!302 = !DILocation(line: 177, column: 15, scope: !284)
!303 = !DILocation(line: 177, column: 18, scope: !284)
!304 = !DILocation(line: 178, column: 12, scope: !284)
!305 = !DILocation(line: 178, column: 15, scope: !284)
!306 = !DILocation(line: 178, column: 22, scope: !284)
!307 = !DILocation(line: 178, column: 10, scope: !284)
!308 = !DILocation(line: 179, column: 9, scope: !309)
!309 = distinct !DILexicalBlock(scope: !284, file: !1, line: 179, column: 9)
!310 = !DILocation(line: 179, column: 12, scope: !309)
!311 = !DILocation(line: 179, column: 19, scope: !309)
!312 = !DILocation(line: 179, column: 28, scope: !309)
!313 = !DILocation(line: 179, column: 9, scope: !284)
!314 = !DILocation(line: 180, column: 19, scope: !309)
!315 = !DILocation(line: 180, column: 22, scope: !309)
!316 = !DILocation(line: 180, column: 9, scope: !309)
!317 = !DILocation(line: 182, column: 24, scope: !309)
!318 = !DILocation(line: 182, column: 27, scope: !309)
!319 = !DILocation(line: 182, column: 9, scope: !309)
!320 = !DILocation(line: 183, column: 1, scope: !284)
!321 = distinct !DISubprogram(name: "percolate_down", scope: !1, file: !1, line: 123, type: !217, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!322 = !DILocalVariable(name: "q", arg: 1, scope: !321, file: !1, line: 123, type: !32)
!323 = !DILocation(line: 123, column: 26, scope: !321)
!324 = !DILocalVariable(name: "i", arg: 2, scope: !321, file: !1, line: 123, type: !20)
!325 = !DILocation(line: 123, column: 36, scope: !321)
!326 = !DILocalVariable(name: "child_node", scope: !321, file: !1, line: 125, type: !20)
!327 = !DILocation(line: 125, column: 12, scope: !321)
!328 = !DILocalVariable(name: "moving_node", scope: !321, file: !1, line: 126, type: !4)
!329 = !DILocation(line: 126, column: 11, scope: !321)
!330 = !DILocation(line: 126, column: 30, scope: !321)
!331 = !DILocation(line: 126, column: 25, scope: !321)
!332 = !DILocation(line: 126, column: 28, scope: !321)
!333 = !DILocalVariable(name: "moving_pri", scope: !321, file: !1, line: 127, type: !14)
!334 = !DILocation(line: 127, column: 18, scope: !321)
!335 = !DILocation(line: 127, column: 31, scope: !321)
!336 = !DILocation(line: 127, column: 34, scope: !321)
!337 = !DILocation(line: 127, column: 41, scope: !321)
!338 = !DILocation(line: 129, column: 5, scope: !321)
!339 = !DILocation(line: 129, column: 35, scope: !321)
!340 = !DILocation(line: 129, column: 38, scope: !321)
!341 = !DILocation(line: 129, column: 26, scope: !321)
!342 = !DILocation(line: 129, column: 24, scope: !321)
!343 = !DILocation(line: 129, column: 42, scope: !321)
!344 = !DILocation(line: 130, column: 12, scope: !321)
!345 = !DILocation(line: 130, column: 15, scope: !321)
!346 = !DILocation(line: 130, column: 22, scope: !321)
!347 = !DILocation(line: 130, column: 34, scope: !321)
!348 = !DILocation(line: 130, column: 37, scope: !321)
!349 = !DILocation(line: 130, column: 49, scope: !321)
!350 = !DILocation(line: 130, column: 44, scope: !321)
!351 = !DILocation(line: 130, column: 47, scope: !321)
!352 = !DILocation(line: 132, column: 24, scope: !353)
!353 = distinct !DILexicalBlock(scope: !321, file: !1, line: 131, column: 5)
!354 = !DILocation(line: 132, column: 19, scope: !353)
!355 = !DILocation(line: 132, column: 22, scope: !353)
!356 = !DILocation(line: 132, column: 14, scope: !353)
!357 = !DILocation(line: 132, column: 9, scope: !353)
!358 = !DILocation(line: 132, column: 12, scope: !353)
!359 = !DILocation(line: 132, column: 17, scope: !353)
!360 = !DILocation(line: 133, column: 9, scope: !353)
!361 = !DILocation(line: 133, column: 12, scope: !353)
!362 = !DILocation(line: 133, column: 24, scope: !353)
!363 = !DILocation(line: 133, column: 19, scope: !353)
!364 = !DILocation(line: 133, column: 22, scope: !353)
!365 = !DILocation(line: 133, column: 28, scope: !353)
!366 = !DILocation(line: 134, column: 13, scope: !353)
!367 = !DILocation(line: 134, column: 11, scope: !353)
!368 = distinct !{!368, !338}
!369 = !DILocation(line: 137, column: 15, scope: !321)
!370 = !DILocation(line: 137, column: 10, scope: !321)
!371 = !DILocation(line: 137, column: 5, scope: !321)
!372 = !DILocation(line: 137, column: 8, scope: !321)
!373 = !DILocation(line: 137, column: 13, scope: !321)
!374 = !DILocation(line: 138, column: 5, scope: !321)
!375 = !DILocation(line: 138, column: 8, scope: !321)
!376 = !DILocation(line: 138, column: 15, scope: !321)
!377 = !DILocation(line: 138, column: 28, scope: !321)
!378 = !DILocation(line: 139, column: 1, scope: !321)
!379 = distinct !DISubprogram(name: "maxchild", scope: !1, file: !1, line: 107, type: !380, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!380 = !DISubroutineType(types: !381)
!381 = !{!20, !32, !20}
!382 = !DILocalVariable(name: "q", arg: 1, scope: !379, file: !1, line: 107, type: !32)
!383 = !DILocation(line: 107, column: 20, scope: !379)
!384 = !DILocalVariable(name: "i", arg: 2, scope: !379, file: !1, line: 107, type: !20)
!385 = !DILocation(line: 107, column: 30, scope: !379)
!386 = !DILocalVariable(name: "child_node", scope: !379, file: !1, line: 109, type: !20)
!387 = !DILocation(line: 109, column: 12, scope: !379)
!388 = !DILocation(line: 109, column: 25, scope: !379)
!389 = !DILocation(line: 111, column: 9, scope: !390)
!390 = distinct !DILexicalBlock(scope: !379, file: !1, line: 111, column: 9)
!391 = !DILocation(line: 111, column: 23, scope: !390)
!392 = !DILocation(line: 111, column: 26, scope: !390)
!393 = !DILocation(line: 111, column: 20, scope: !390)
!394 = !DILocation(line: 111, column: 9, scope: !379)
!395 = !DILocation(line: 112, column: 9, scope: !390)
!396 = !DILocation(line: 114, column: 10, scope: !397)
!397 = distinct !DILexicalBlock(scope: !379, file: !1, line: 114, column: 9)
!398 = !DILocation(line: 114, column: 20, scope: !397)
!399 = !DILocation(line: 114, column: 26, scope: !397)
!400 = !DILocation(line: 114, column: 29, scope: !397)
!401 = !DILocation(line: 114, column: 24, scope: !397)
!402 = !DILocation(line: 114, column: 34, scope: !397)
!403 = !DILocation(line: 115, column: 9, scope: !397)
!404 = !DILocation(line: 115, column: 12, scope: !397)
!405 = !DILocation(line: 115, column: 19, scope: !397)
!406 = !DILocation(line: 115, column: 22, scope: !397)
!407 = !DILocation(line: 115, column: 34, scope: !397)
!408 = !DILocation(line: 115, column: 29, scope: !397)
!409 = !DILocation(line: 115, column: 32, scope: !397)
!410 = !DILocation(line: 115, column: 48, scope: !397)
!411 = !DILocation(line: 115, column: 51, scope: !397)
!412 = !DILocation(line: 115, column: 63, scope: !397)
!413 = !DILocation(line: 115, column: 73, scope: !397)
!414 = !DILocation(line: 115, column: 58, scope: !397)
!415 = !DILocation(line: 115, column: 61, scope: !397)
!416 = !DILocation(line: 114, column: 9, scope: !379)
!417 = !DILocation(line: 116, column: 19, scope: !397)
!418 = !DILocation(line: 116, column: 9, scope: !397)
!419 = !DILocation(line: 118, column: 12, scope: !379)
!420 = !DILocation(line: 118, column: 5, scope: !379)
!421 = !DILocation(line: 119, column: 1, scope: !379)
!422 = distinct !DISubprogram(name: "pqueue_remove", scope: !1, file: !1, line: 187, type: !154, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!423 = !DILocalVariable(name: "q", arg: 1, scope: !422, file: !1, line: 187, type: !32)
!424 = !DILocation(line: 187, column: 25, scope: !422)
!425 = !DILocalVariable(name: "d", arg: 2, scope: !422, file: !1, line: 187, type: !4)
!426 = !DILocation(line: 187, column: 34, scope: !422)
!427 = !DILocalVariable(name: "posn", scope: !422, file: !1, line: 189, type: !20)
!428 = !DILocation(line: 189, column: 12, scope: !422)
!429 = !DILocation(line: 189, column: 19, scope: !422)
!430 = !DILocation(line: 189, column: 22, scope: !422)
!431 = !DILocation(line: 189, column: 29, scope: !422)
!432 = !DILocation(line: 190, column: 25, scope: !422)
!433 = !DILocation(line: 190, column: 28, scope: !422)
!434 = !DILocation(line: 190, column: 23, scope: !422)
!435 = !DILocation(line: 190, column: 18, scope: !422)
!436 = !DILocation(line: 190, column: 21, scope: !422)
!437 = !DILocation(line: 190, column: 10, scope: !422)
!438 = !DILocation(line: 190, column: 5, scope: !422)
!439 = !DILocation(line: 190, column: 8, scope: !422)
!440 = !DILocation(line: 190, column: 16, scope: !422)
!441 = !DILocation(line: 191, column: 9, scope: !442)
!442 = distinct !DILexicalBlock(scope: !422, file: !1, line: 191, column: 9)
!443 = !DILocation(line: 191, column: 12, scope: !442)
!444 = !DILocation(line: 191, column: 19, scope: !442)
!445 = !DILocation(line: 191, column: 22, scope: !442)
!446 = !DILocation(line: 191, column: 29, scope: !442)
!447 = !DILocation(line: 191, column: 33, scope: !442)
!448 = !DILocation(line: 191, column: 36, scope: !442)
!449 = !DILocation(line: 191, column: 48, scope: !442)
!450 = !DILocation(line: 191, column: 43, scope: !442)
!451 = !DILocation(line: 191, column: 46, scope: !442)
!452 = !DILocation(line: 191, column: 9, scope: !422)
!453 = !DILocation(line: 192, column: 19, scope: !442)
!454 = !DILocation(line: 192, column: 22, scope: !442)
!455 = !DILocation(line: 192, column: 9, scope: !442)
!456 = !DILocation(line: 194, column: 24, scope: !442)
!457 = !DILocation(line: 194, column: 27, scope: !442)
!458 = !DILocation(line: 194, column: 9, scope: !442)
!459 = !DILocation(line: 196, column: 5, scope: !422)
!460 = distinct !DISubprogram(name: "pqueue_pop", scope: !1, file: !1, line: 201, type: !461, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!461 = !DISubroutineType(types: !462)
!462 = !{!4, !32}
!463 = !DILocalVariable(name: "q", arg: 1, scope: !460, file: !1, line: 201, type: !32)
!464 = !DILocation(line: 201, column: 22, scope: !460)
!465 = !DILocalVariable(name: "head", scope: !460, file: !1, line: 203, type: !4)
!466 = !DILocation(line: 203, column: 11, scope: !460)
!467 = !DILocation(line: 205, column: 10, scope: !468)
!468 = distinct !DILexicalBlock(scope: !460, file: !1, line: 205, column: 9)
!469 = !DILocation(line: 205, column: 12, scope: !468)
!470 = !DILocation(line: 205, column: 15, scope: !468)
!471 = !DILocation(line: 205, column: 18, scope: !468)
!472 = !DILocation(line: 205, column: 23, scope: !468)
!473 = !DILocation(line: 205, column: 9, scope: !460)
!474 = !DILocation(line: 206, column: 9, scope: !468)
!475 = !DILocation(line: 208, column: 12, scope: !460)
!476 = !DILocation(line: 208, column: 15, scope: !460)
!477 = !DILocation(line: 208, column: 10, scope: !460)
!478 = !DILocation(line: 209, column: 22, scope: !460)
!479 = !DILocation(line: 209, column: 25, scope: !460)
!480 = !DILocation(line: 209, column: 20, scope: !460)
!481 = !DILocation(line: 209, column: 15, scope: !460)
!482 = !DILocation(line: 209, column: 18, scope: !460)
!483 = !DILocation(line: 209, column: 5, scope: !460)
!484 = !DILocation(line: 209, column: 8, scope: !460)
!485 = !DILocation(line: 209, column: 13, scope: !460)
!486 = !DILocation(line: 210, column: 20, scope: !460)
!487 = !DILocation(line: 210, column: 5, scope: !460)
!488 = !DILocation(line: 212, column: 12, scope: !460)
!489 = !DILocation(line: 212, column: 5, scope: !460)
!490 = !DILocation(line: 213, column: 1, scope: !460)
!491 = distinct !DISubprogram(name: "pqueue_peek", scope: !1, file: !1, line: 217, type: !461, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!492 = !DILocalVariable(name: "q", arg: 1, scope: !491, file: !1, line: 217, type: !32)
!493 = !DILocation(line: 217, column: 23, scope: !491)
!494 = !DILocalVariable(name: "d", scope: !491, file: !1, line: 219, type: !4)
!495 = !DILocation(line: 219, column: 11, scope: !491)
!496 = !DILocation(line: 220, column: 10, scope: !497)
!497 = distinct !DILexicalBlock(scope: !491, file: !1, line: 220, column: 9)
!498 = !DILocation(line: 220, column: 12, scope: !497)
!499 = !DILocation(line: 220, column: 15, scope: !497)
!500 = !DILocation(line: 220, column: 18, scope: !497)
!501 = !DILocation(line: 220, column: 23, scope: !497)
!502 = !DILocation(line: 220, column: 9, scope: !491)
!503 = !DILocation(line: 221, column: 9, scope: !497)
!504 = !DILocation(line: 222, column: 9, scope: !491)
!505 = !DILocation(line: 222, column: 12, scope: !491)
!506 = !DILocation(line: 222, column: 7, scope: !491)
!507 = !DILocation(line: 223, column: 12, scope: !491)
!508 = !DILocation(line: 223, column: 5, scope: !491)
!509 = !DILocation(line: 224, column: 1, scope: !491)
!510 = distinct !DISubprogram(name: "pqueue_dump", scope: !1, file: !1, line: 228, type: !511, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !32, !513, !574}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 153, baseType: !516)
!515 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !515, line: 122, size: 1216, align: 64, elements: !517)
!517 = !{!518, !521, !522, !523, !525, !526, !531, !532, !533, !537, !543, !552, !558, !559, !562, !563, !567, !571, !572, !573}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !516, file: !515, line: 123, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !516, file: !515, line: 124, baseType: !18, size: 32, align: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !516, file: !515, line: 125, baseType: !18, size: 32, align: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !516, file: !515, line: 126, baseType: !524, size: 16, align: 16, offset: 128)
!524 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !516, file: !515, line: 127, baseType: !524, size: 16, align: 16, offset: 144)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !516, file: !515, line: 128, baseType: !527, size: 128, align: 64, offset: 192)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !515, line: 88, size: 128, align: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !527, file: !515, line: 89, baseType: !519, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !527, file: !515, line: 90, baseType: !18, size: 32, align: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !516, file: !515, line: 129, baseType: !18, size: 32, align: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !516, file: !515, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !516, file: !515, line: 133, baseType: !534, size: 64, align: 64, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!18, !4}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !516, file: !515, line: 134, baseType: !538, size: 64, align: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!18, !4, !541, !18}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !516, file: !515, line: 135, baseType: !544, size: 64, align: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!547, !4, !547, !18}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !515, line: 77, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !549, line: 71, baseType: !550)
!549 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 46, baseType: !551)
!551 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !516, file: !515, line: 136, baseType: !553, size: 64, align: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!18, !4, !556, !18}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !516, file: !515, line: 139, baseType: !527, size: 128, align: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !516, file: !515, line: 140, baseType: !560, size: 64, align: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !515, line: 94, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !516, file: !515, line: 141, baseType: !18, size: 32, align: 32, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !516, file: !515, line: 144, baseType: !564, size: 24, align: 8, offset: 928)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 24, align: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 3)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !516, file: !515, line: 145, baseType: !568, size: 8, align: 8, offset: 952)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 8, align: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 1)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !516, file: !515, line: 148, baseType: !527, size: 128, align: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !516, file: !515, line: 151, baseType: !18, size: 32, align: 32, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !516, file: !515, line: 152, baseType: !547, size: 64, align: 64, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_print_entry_f", file: !15, line: 53, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !513, !4}
!578 = !DILocalVariable(name: "q", arg: 1, scope: !510, file: !1, line: 228, type: !32)
!579 = !DILocation(line: 228, column: 23, scope: !510)
!580 = !DILocalVariable(name: "out", arg: 2, scope: !510, file: !1, line: 229, type: !513)
!581 = !DILocation(line: 229, column: 19, scope: !510)
!582 = !DILocalVariable(name: "print", arg: 3, scope: !510, file: !1, line: 230, type: !574)
!583 = !DILocation(line: 230, column: 34, scope: !510)
!584 = !DILocalVariable(name: "i", scope: !510, file: !1, line: 232, type: !18)
!585 = !DILocation(line: 232, column: 9, scope: !510)
!586 = !DILocation(line: 234, column: 13, scope: !510)
!587 = !DILocation(line: 234, column: 5, scope: !510)
!588 = !DILocation(line: 235, column: 12, scope: !589)
!589 = distinct !DILexicalBlock(scope: !510, file: !1, line: 235, column: 5)
!590 = !DILocation(line: 235, column: 10, scope: !589)
!591 = !DILocation(line: 235, column: 17, scope: !592)
!592 = distinct !DILexicalBlock(scope: !589, file: !1, line: 235, column: 5)
!593 = !DILocation(line: 235, column: 21, scope: !592)
!594 = !DILocation(line: 235, column: 24, scope: !592)
!595 = !DILocation(line: 235, column: 19, scope: !592)
!596 = !DILocation(line: 235, column: 5, scope: !589)
!597 = !DILocation(line: 236, column: 17, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !1, line: 235, column: 35)
!599 = !DILocation(line: 238, column: 17, scope: !598)
!600 = !DILocation(line: 239, column: 17, scope: !598)
!601 = !DILocation(line: 239, column: 26, scope: !598)
!602 = !DILocation(line: 239, column: 36, scope: !598)
!603 = !DILocation(line: 240, column: 40, scope: !598)
!604 = !DILocation(line: 240, column: 43, scope: !598)
!605 = !DILocation(line: 240, column: 31, scope: !598)
!606 = !DILocation(line: 240, column: 17, scope: !598)
!607 = !DILocation(line: 236, column: 9, scope: !598)
!608 = !DILocation(line: 241, column: 9, scope: !598)
!609 = !DILocation(line: 241, column: 15, scope: !598)
!610 = !DILocation(line: 241, column: 25, scope: !598)
!611 = !DILocation(line: 241, column: 20, scope: !598)
!612 = !DILocation(line: 241, column: 23, scope: !598)
!613 = !DILocation(line: 242, column: 5, scope: !598)
!614 = !DILocation(line: 235, column: 31, scope: !592)
!615 = !DILocation(line: 235, column: 5, scope: !592)
!616 = distinct !{!616, !617}
!617 = !DILocation(line: 235, column: 5, scope: !510)
!618 = !DILocation(line: 243, column: 1, scope: !510)
!619 = distinct !DISubprogram(name: "pqueue_print", scope: !1, file: !1, line: 261, type: !511, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!620 = !DILocalVariable(name: "q", arg: 1, scope: !619, file: !1, line: 261, type: !32)
!621 = !DILocation(line: 261, column: 24, scope: !619)
!622 = !DILocalVariable(name: "out", arg: 2, scope: !619, file: !1, line: 262, type: !513)
!623 = !DILocation(line: 262, column: 20, scope: !619)
!624 = !DILocalVariable(name: "print", arg: 3, scope: !619, file: !1, line: 263, type: !574)
!625 = !DILocation(line: 263, column: 35, scope: !619)
!626 = !DILocalVariable(name: "dup", scope: !619, file: !1, line: 265, type: !32)
!627 = !DILocation(line: 265, column: 15, scope: !619)
!628 = !DILocalVariable(name: "e", scope: !619, file: !1, line: 266, type: !4)
!629 = !DILocation(line: 266, column: 8, scope: !619)
!630 = !DILocation(line: 268, column: 23, scope: !619)
!631 = !DILocation(line: 268, column: 26, scope: !619)
!632 = !DILocation(line: 269, column: 23, scope: !619)
!633 = !DILocation(line: 269, column: 26, scope: !619)
!634 = !DILocation(line: 269, column: 34, scope: !619)
!635 = !DILocation(line: 269, column: 37, scope: !619)
!636 = !DILocation(line: 270, column: 23, scope: !619)
!637 = !DILocation(line: 270, column: 26, scope: !619)
!638 = !DILocation(line: 268, column: 11, scope: !619)
!639 = !DILocation(line: 268, column: 9, scope: !619)
!640 = !DILocation(line: 271, column: 17, scope: !619)
!641 = !DILocation(line: 271, column: 20, scope: !619)
!642 = !DILocation(line: 271, column: 5, scope: !619)
!643 = !DILocation(line: 271, column: 10, scope: !619)
!644 = !DILocation(line: 271, column: 15, scope: !619)
!645 = !DILocation(line: 272, column: 18, scope: !619)
!646 = !DILocation(line: 272, column: 21, scope: !619)
!647 = !DILocation(line: 272, column: 5, scope: !619)
!648 = !DILocation(line: 272, column: 10, scope: !619)
!649 = !DILocation(line: 272, column: 16, scope: !619)
!650 = !DILocation(line: 273, column: 17, scope: !619)
!651 = !DILocation(line: 273, column: 20, scope: !619)
!652 = !DILocation(line: 273, column: 5, scope: !619)
!653 = !DILocation(line: 273, column: 10, scope: !619)
!654 = !DILocation(line: 273, column: 15, scope: !619)
!655 = !DILocation(line: 275, column: 5, scope: !619)
!656 = !DILocation(line: 277, column: 5, scope: !619)
!657 = !DILocation(line: 277, column: 28, scope: !619)
!658 = !DILocation(line: 277, column: 17, scope: !619)
!659 = !DILocation(line: 277, column: 15, scope: !619)
!660 = !DILocation(line: 278, column: 3, scope: !619)
!661 = !DILocation(line: 278, column: 9, scope: !619)
!662 = !DILocation(line: 278, column: 14, scope: !619)
!663 = distinct !{!663, !656}
!664 = !DILocation(line: 280, column: 17, scope: !619)
!665 = !DILocation(line: 280, column: 5, scope: !619)
!666 = !DILocation(line: 281, column: 1, scope: !619)
!667 = distinct !DISubprogram(name: "set_pri", scope: !1, file: !1, line: 254, type: !52, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!668 = !DILocalVariable(name: "d", arg: 1, scope: !667, file: !1, line: 254, type: !4)
!669 = !DILocation(line: 254, column: 15, scope: !667)
!670 = !DILocalVariable(name: "pri", arg: 2, scope: !667, file: !1, line: 254, type: !14)
!671 = !DILocation(line: 254, column: 31, scope: !667)
!672 = !DILocation(line: 257, column: 1, scope: !667)
!673 = distinct !DISubprogram(name: "set_pos", scope: !1, file: !1, line: 247, type: !62, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!674 = !DILocalVariable(name: "d", arg: 1, scope: !673, file: !1, line: 247, type: !4)
!675 = !DILocation(line: 247, column: 15, scope: !673)
!676 = !DILocalVariable(name: "val", arg: 2, scope: !673, file: !1, line: 247, type: !20)
!677 = !DILocation(line: 247, column: 25, scope: !673)
!678 = !DILocation(line: 250, column: 1, scope: !673)
!679 = distinct !DISubprogram(name: "pqueue_is_valid", scope: !1, file: !1, line: 306, type: !680, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!680 = !DISubroutineType(types: !681)
!681 = !{!18, !32}
!682 = !DILocalVariable(name: "q", arg: 1, scope: !679, file: !1, line: 306, type: !32)
!683 = !DILocation(line: 306, column: 27, scope: !679)
!684 = !DILocation(line: 308, column: 29, scope: !679)
!685 = !DILocation(line: 308, column: 12, scope: !679)
!686 = !DILocation(line: 308, column: 5, scope: !679)
!687 = distinct !DISubprogram(name: "subtree_is_valid", scope: !1, file: !1, line: 285, type: !688, isLocal: true, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!688 = !DISubroutineType(types: !689)
!689 = !{!18, !32, !18}
!690 = !DILocalVariable(name: "q", arg: 1, scope: !687, file: !1, line: 285, type: !32)
!691 = !DILocation(line: 285, column: 28, scope: !687)
!692 = !DILocalVariable(name: "pos", arg: 2, scope: !687, file: !1, line: 285, type: !18)
!693 = !DILocation(line: 285, column: 35, scope: !687)
!694 = !DILocation(line: 287, column: 9, scope: !695)
!695 = distinct !DILexicalBlock(scope: !687, file: !1, line: 287, column: 9)
!696 = !DILocation(line: 287, column: 21, scope: !695)
!697 = !DILocation(line: 287, column: 24, scope: !695)
!698 = !DILocation(line: 287, column: 19, scope: !695)
!699 = !DILocation(line: 287, column: 9, scope: !687)
!700 = !DILocation(line: 289, column: 13, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 289, column: 13)
!702 = distinct !DILexicalBlock(scope: !695, file: !1, line: 287, column: 30)
!703 = !DILocation(line: 289, column: 16, scope: !701)
!704 = !DILocation(line: 289, column: 23, scope: !701)
!705 = !DILocation(line: 289, column: 26, scope: !701)
!706 = !DILocation(line: 289, column: 38, scope: !701)
!707 = !DILocation(line: 289, column: 33, scope: !701)
!708 = !DILocation(line: 289, column: 36, scope: !701)
!709 = !DILocation(line: 289, column: 45, scope: !701)
!710 = !DILocation(line: 289, column: 48, scope: !701)
!711 = !DILocation(line: 289, column: 60, scope: !701)
!712 = !DILocation(line: 289, column: 55, scope: !701)
!713 = !DILocation(line: 289, column: 58, scope: !701)
!714 = !DILocation(line: 289, column: 13, scope: !702)
!715 = !DILocation(line: 290, column: 13, scope: !701)
!716 = !DILocation(line: 291, column: 31, scope: !717)
!717 = distinct !DILexicalBlock(scope: !702, file: !1, line: 291, column: 13)
!718 = !DILocation(line: 291, column: 34, scope: !717)
!719 = !DILocation(line: 291, column: 14, scope: !717)
!720 = !DILocation(line: 291, column: 13, scope: !702)
!721 = !DILocation(line: 292, column: 13, scope: !717)
!722 = !DILocation(line: 293, column: 5, scope: !702)
!723 = !DILocation(line: 294, column: 9, scope: !724)
!724 = distinct !DILexicalBlock(scope: !687, file: !1, line: 294, column: 9)
!725 = !DILocation(line: 294, column: 22, scope: !724)
!726 = !DILocation(line: 294, column: 25, scope: !724)
!727 = !DILocation(line: 294, column: 20, scope: !724)
!728 = !DILocation(line: 294, column: 9, scope: !687)
!729 = !DILocation(line: 296, column: 13, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !1, line: 296, column: 13)
!731 = distinct !DILexicalBlock(scope: !724, file: !1, line: 294, column: 31)
!732 = !DILocation(line: 296, column: 16, scope: !730)
!733 = !DILocation(line: 296, column: 23, scope: !730)
!734 = !DILocation(line: 296, column: 26, scope: !730)
!735 = !DILocation(line: 296, column: 38, scope: !730)
!736 = !DILocation(line: 296, column: 33, scope: !730)
!737 = !DILocation(line: 296, column: 36, scope: !730)
!738 = !DILocation(line: 296, column: 45, scope: !730)
!739 = !DILocation(line: 296, column: 48, scope: !730)
!740 = !DILocation(line: 296, column: 60, scope: !730)
!741 = !DILocation(line: 296, column: 55, scope: !730)
!742 = !DILocation(line: 296, column: 58, scope: !730)
!743 = !DILocation(line: 296, column: 13, scope: !731)
!744 = !DILocation(line: 297, column: 13, scope: !730)
!745 = !DILocation(line: 298, column: 31, scope: !746)
!746 = distinct !DILexicalBlock(scope: !731, file: !1, line: 298, column: 13)
!747 = !DILocation(line: 298, column: 34, scope: !746)
!748 = !DILocation(line: 298, column: 14, scope: !746)
!749 = !DILocation(line: 298, column: 13, scope: !731)
!750 = !DILocation(line: 299, column: 13, scope: !746)
!751 = !DILocation(line: 300, column: 5, scope: !731)
!752 = !DILocation(line: 301, column: 5, scope: !687)
!753 = !DILocation(line: 302, column: 1, scope: !687)
!754 = distinct !DISubprogram(name: "main", scope: !7, file: !7, line: 82, type: !755, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !6, variables: !2)
!755 = !DISubroutineType(types: !756)
!756 = !{!18}
!757 = !DILocalVariable(name: "pq", scope: !754, file: !7, line: 84, type: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_t", file: !15, line: 68, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pqueue_t", file: !15, line: 57, size: 576, align: 64, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !15, line: 59, baseType: !20, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !760, file: !15, line: 60, baseType: !20, size: 64, align: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !760, file: !15, line: 61, baseType: !20, size: 64, align: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cmppri", scope: !760, file: !15, line: 62, baseType: !40, size: 64, align: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getpri", scope: !760, file: !15, line: 63, baseType: !45, size: 64, align: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setpri", scope: !760, file: !15, line: 64, baseType: !50, size: 64, align: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getpos", scope: !760, file: !15, line: 65, baseType: !55, size: 64, align: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "setpos", scope: !760, file: !15, line: 66, baseType: !60, size: 64, align: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !760, file: !15, line: 67, baseType: !65, size: 64, align: 64, offset: 512)
!771 = !DILocation(line: 84, column: 12, scope: !754)
!772 = !DILocalVariable(name: "ns", scope: !754, file: !7, line: 85, type: !9)
!773 = !DILocation(line: 85, column: 12, scope: !754)
!774 = !DILocalVariable(name: "n", scope: !754, file: !7, line: 86, type: !9)
!775 = !DILocation(line: 86, column: 12, scope: !754)
!776 = !DILocation(line: 88, column: 7, scope: !754)
!777 = !DILocation(line: 88, column: 5, scope: !754)
!778 = !DILocation(line: 89, column: 7, scope: !754)
!779 = !DILocation(line: 89, column: 5, scope: !754)
!780 = !DILocation(line: 90, column: 8, scope: !781)
!781 = distinct !DILexicalBlock(scope: !754, file: !7, line: 90, column: 6)
!782 = !DILocation(line: 90, column: 11, scope: !781)
!783 = !DILocation(line: 90, column: 14, scope: !781)
!784 = !DILocation(line: 90, column: 6, scope: !754)
!785 = !DILocation(line: 90, column: 19, scope: !781)
!786 = !DILocation(line: 92, column: 2, scope: !754)
!787 = !DILocation(line: 92, column: 8, scope: !754)
!788 = !DILocation(line: 92, column: 12, scope: !754)
!789 = !DILocation(line: 92, column: 17, scope: !754)
!790 = !DILocation(line: 92, column: 23, scope: !754)
!791 = !DILocation(line: 92, column: 27, scope: !754)
!792 = !DILocation(line: 92, column: 47, scope: !754)
!793 = !DILocation(line: 92, column: 52, scope: !754)
!794 = !DILocation(line: 92, column: 51, scope: !754)
!795 = !DILocation(line: 92, column: 33, scope: !754)
!796 = !DILocation(line: 93, column: 2, scope: !754)
!797 = !DILocation(line: 93, column: 8, scope: !754)
!798 = !DILocation(line: 93, column: 12, scope: !754)
!799 = !DILocation(line: 93, column: 17, scope: !754)
!800 = !DILocation(line: 93, column: 23, scope: !754)
!801 = !DILocation(line: 93, column: 27, scope: !754)
!802 = !DILocation(line: 93, column: 47, scope: !754)
!803 = !DILocation(line: 93, column: 52, scope: !754)
!804 = !DILocation(line: 93, column: 51, scope: !754)
!805 = !DILocation(line: 93, column: 33, scope: !754)
!806 = !DILocation(line: 94, column: 2, scope: !754)
!807 = !DILocation(line: 94, column: 8, scope: !754)
!808 = !DILocation(line: 94, column: 12, scope: !754)
!809 = !DILocation(line: 94, column: 17, scope: !754)
!810 = !DILocation(line: 94, column: 23, scope: !754)
!811 = !DILocation(line: 94, column: 27, scope: !754)
!812 = !DILocation(line: 94, column: 47, scope: !754)
!813 = !DILocation(line: 94, column: 52, scope: !754)
!814 = !DILocation(line: 94, column: 51, scope: !754)
!815 = !DILocation(line: 94, column: 33, scope: !754)
!816 = !DILocation(line: 95, column: 2, scope: !754)
!817 = !DILocation(line: 95, column: 8, scope: !754)
!818 = !DILocation(line: 95, column: 12, scope: !754)
!819 = !DILocation(line: 95, column: 17, scope: !754)
!820 = !DILocation(line: 95, column: 23, scope: !754)
!821 = !DILocation(line: 95, column: 27, scope: !754)
!822 = !DILocation(line: 95, column: 47, scope: !754)
!823 = !DILocation(line: 95, column: 52, scope: !754)
!824 = !DILocation(line: 95, column: 51, scope: !754)
!825 = !DILocation(line: 95, column: 33, scope: !754)
!826 = !DILocation(line: 96, column: 2, scope: !754)
!827 = !DILocation(line: 96, column: 8, scope: !754)
!828 = !DILocation(line: 96, column: 12, scope: !754)
!829 = !DILocation(line: 96, column: 17, scope: !754)
!830 = !DILocation(line: 96, column: 23, scope: !754)
!831 = !DILocation(line: 96, column: 27, scope: !754)
!832 = !DILocation(line: 96, column: 47, scope: !754)
!833 = !DILocation(line: 96, column: 52, scope: !754)
!834 = !DILocation(line: 96, column: 51, scope: !754)
!835 = !DILocation(line: 96, column: 33, scope: !754)
!836 = !DILocation(line: 98, column: 18, scope: !754)
!837 = !DILocation(line: 98, column: 6, scope: !754)
!838 = !DILocation(line: 98, column: 4, scope: !754)
!839 = !DILocation(line: 99, column: 30, scope: !754)
!840 = !DILocation(line: 99, column: 33, scope: !754)
!841 = !DILocation(line: 99, column: 38, scope: !754)
