; ModuleID = 'pqueue.c'
source_filename = "pqueue.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.13.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct.pqueue_t = type { i64, i64, i64, i32 (i64, i64)*, i64 (i8*)*, void (i8*, i64)*, i64 (i8*)*, void (i8*, i64)*, i8** }

@__stdoutp = external global %struct.__sFILE*, align 8
@.str = private unnamed_addr constant [37 x i8] c"posn\09left\09right\09parent\09maxchild\09...\0A\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"%d\09%d\09%d\09%d\09%ul\09\00", align 1

; Function Attrs: nounwind ssp uwtable
define %struct.pqueue_t* @pqueue_init(i64, i32 (i64, i64)*, i64 (i8*)*, void (i8*, i64)*, i64 (i8*)*, void (i8*, i64)*) #0 !dbg !10 {
  %7 = alloca %struct.pqueue_t*, align 8
  %8 = alloca i64, align 8
  %9 = alloca i32 (i64, i64)*, align 8
  %10 = alloca i64 (i8*)*, align 8
  %11 = alloca void (i8*, i64)*, align 8
  %12 = alloca i64 (i8*)*, align 8
  %13 = alloca void (i8*, i64)*, align 8
  %14 = alloca %struct.pqueue_t*, align 8
  store i64 %0, i64* %8, align 8
  call void @llvm.dbg.declare(metadata i64* %8, metadata !56, metadata !57), !dbg !58

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1 (tags/RELEASE_391/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "pqueue.c", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 2, !"Dwarf Version", i32 2}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"PIC Level", i32 2}
!9 = !{!"clang version 3.9.1 (tags/RELEASE_391/final)"}
!10 = distinct !DISubprogram(name: "pqueue_init", scope: !1, file: !1, line: 40, type: !11, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !19, !27, !35, !40, !45, !50}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_t", file: !15, line: 68, baseType: !16)
!15 = !DIFile(filename: "./pqueue.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pqueue_t", file: !15, line: 57, size: 576, align: 64, elements: !17)
!17 = !{!18, !24, !25, !26, !34, !39, !44, !49, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !15, line: 59, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 31, baseType: !21)
!20 = !DIFile(filename: "/usr/include/sys/_types/_size_t.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !22, line: 92, baseType: !23)
!22 = !DIFile(filename: "/usr/include/i386/_types.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !16, file: !15, line: 60, baseType: !19, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !16, file: !15, line: 61, baseType: !19, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cmppri", scope: !16, file: !15, line: 62, baseType: !27, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_cmp_pri_f", file: !15, line: 44, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !32}
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_pri_t", file: !15, line: 39, baseType: !33)
!33 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "getpri", scope: !16, file: !15, line: 63, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_get_pri_f", file: !15, line: 42, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!32, !4}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "setpri", scope: !16, file: !15, line: 64, baseType: !40, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_set_pri_f", file: !15, line: 43, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !4, !32}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "getpos", scope: !16, file: !15, line: 65, baseType: !45, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_get_pos_f", file: !15, line: 48, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!19, !4}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "setpos", scope: !16, file: !15, line: 66, baseType: !50, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_set_pos_f", file: !15, line: 49, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !4, !19}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !16, file: !15, line: 67, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!56 = !DILocalVariable(name: "n", arg: 1, scope: !10, file: !1, line: 40, type: !19)
!57 = !DIExpression()
!58 = !DILocation(line: 40, column: 20, scope: !10)
!59 = !DILocalVariable(name: "cmppri", arg: 2, scope: !10, file: !1, line: 41, type: !27)
!60 = !DILocation(line: 41, column: 30, scope: !10)
!61 = !DILocalVariable(name: "getpri", arg: 3, scope: !10, file: !1, line: 42, type: !35)
!62 = !DILocation(line: 42, column: 30, scope: !10)
!63 = !DILocalVariable(name: "setpri", arg: 4, scope: !10, file: !1, line: 43, type: !40)
!64 = !DILocation(line: 43, column: 30, scope: !10)
!65 = !DILocalVariable(name: "getpos", arg: 5, scope: !10, file: !1, line: 44, type: !45)
!66 = !DILocation(line: 44, column: 30, scope: !10)
!67 = !DILocalVariable(name: "setpos", arg: 6, scope: !10, file: !1, line: 45, type: !50)
!68 = !DILocation(line: 45, column: 30, scope: !10)
!69 = !DILocalVariable(name: "q", scope: !10, file: !1, line: 47, type: !13)
!70 = !DILocation(line: 47, column: 15, scope: !10)
!71 = !DILocation(line: 49, column: 15, scope: !72)
!72 = distinct !DILexicalBlock(scope: !10, file: !1, line: 49, column: 9)
!73 = !DILocation(line: 49, column: 13, scope: !72)
!74 = !DILocation(line: 49, column: 9, scope: !10)
!75 = !DILocation(line: 50, column: 9, scope: !72)
!76 = !DILocation(line: 53, column: 26, scope: !77)
!77 = distinct !DILexicalBlock(scope: !10, file: !1, line: 53, column: 9)
!78 = !DILocation(line: 53, column: 28, scope: !77)
!79 = !DILocation(line: 53, column: 33, scope: !77)
!80 = !DILocation(line: 53, column: 18, scope: !77)
!81 = !DILocation(line: 53, column: 11, scope: !77)
!82 = !DILocation(line: 53, column: 14, scope: !77)
!83 = !DILocation(line: 53, column: 16, scope: !77)
!84 = !DILocation(line: 53, column: 9, scope: !10)
!85 = !DILocation(line: 54, column: 14, scope: !86)
!86 = distinct !DILexicalBlock(scope: !77, file: !1, line: 53, column: 53)
!87 = !DILocation(line: 54, column: 9, scope: !86)
!88 = !DILocation(line: 55, column: 9, scope: !86)
!89 = !DILocation(line: 58, column: 5, scope: !10)
!90 = !DILocation(line: 58, column: 8, scope: !10)
!91 = !DILocation(line: 58, column: 13, scope: !10)
!92 = !DILocation(line: 59, column: 27, scope: !10)
!93 = !DILocation(line: 59, column: 28, scope: !10)
!94 = !DILocation(line: 59, column: 16, scope: !10)
!95 = !DILocation(line: 59, column: 19, scope: !10)
!96 = !DILocation(line: 59, column: 24, scope: !10)
!97 = !DILocation(line: 59, column: 5, scope: !10)
!98 = !DILocation(line: 59, column: 8, scope: !10)
!99 = !DILocation(line: 59, column: 14, scope: !10)
!100 = !DILocation(line: 60, column: 17, scope: !10)
!101 = !DILocation(line: 60, column: 5, scope: !10)
!102 = !DILocation(line: 60, column: 8, scope: !10)
!103 = !DILocation(line: 60, column: 15, scope: !10)
!104 = !DILocation(line: 61, column: 17, scope: !10)
!105 = !DILocation(line: 61, column: 5, scope: !10)
!106 = !DILocation(line: 61, column: 8, scope: !10)
!107 = !DILocation(line: 61, column: 15, scope: !10)
!108 = !DILocation(line: 62, column: 17, scope: !10)
!109 = !DILocation(line: 62, column: 5, scope: !10)
!110 = !DILocation(line: 62, column: 8, scope: !10)
!111 = !DILocation(line: 62, column: 15, scope: !10)
!112 = !DILocation(line: 63, column: 17, scope: !10)
!113 = !DILocation(line: 63, column: 5, scope: !10)
!114 = !DILocation(line: 63, column: 8, scope: !10)
!115 = !DILocation(line: 63, column: 15, scope: !10)
!116 = !DILocation(line: 64, column: 17, scope: !10)
!117 = !DILocation(line: 64, column: 5, scope: !10)
!118 = !DILocation(line: 64, column: 8, scope: !10)
!119 = !DILocation(line: 64, column: 15, scope: !10)
!120 = !DILocation(line: 66, column: 12, scope: !10)
!121 = !DILocation(line: 66, column: 5, scope: !10)
!122 = !DILocation(line: 67, column: 1, scope: !10)
!123 = distinct !DISubprogram(name: "pqueue_free", scope: !1, file: !1, line: 71, type: !124, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !13}
!126 = !DILocalVariable(name: "q", arg: 1, scope: !123, file: !1, line: 71, type: !13)
!127 = !DILocation(line: 71, column: 23, scope: !123)
!128 = !DILocation(line: 73, column: 10, scope: !123)
!129 = !DILocation(line: 73, column: 13, scope: !123)
!130 = !DILocation(line: 73, column: 5, scope: !123)
!131 = !DILocation(line: 74, column: 10, scope: !123)
!132 = !DILocation(line: 74, column: 5, scope: !123)
!133 = !DILocation(line: 75, column: 1, scope: !123)
!134 = distinct !DISubprogram(name: "pqueue_size", scope: !1, file: !1, line: 79, type: !135, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!135 = !DISubroutineType(types: !136)
!136 = !{!19, !13}
!137 = !DILocalVariable(name: "q", arg: 1, scope: !134, file: !1, line: 79, type: !13)
!138 = !DILocation(line: 79, column: 23, scope: !134)
!139 = !DILocation(line: 82, column: 13, scope: !134)
!140 = !DILocation(line: 82, column: 16, scope: !134)
!141 = !DILocation(line: 82, column: 21, scope: !134)
!142 = !DILocation(line: 82, column: 5, scope: !134)
!143 = distinct !DISubprogram(name: "pqueue_insert", scope: !1, file: !1, line: 143, type: !144, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!144 = !DISubroutineType(types: !145)
!145 = !{!31, !13, !4}
!146 = !DILocalVariable(name: "q", arg: 1, scope: !143, file: !1, line: 143, type: !13)
!147 = !DILocation(line: 143, column: 25, scope: !143)
!148 = !DILocalVariable(name: "d", arg: 2, scope: !143, file: !1, line: 143, type: !4)
!149 = !DILocation(line: 143, column: 34, scope: !143)
!150 = !DILocalVariable(name: "tmp", scope: !143, file: !1, line: 145, type: !4)
!151 = !DILocation(line: 145, column: 11, scope: !143)
!152 = !DILocalVariable(name: "i", scope: !143, file: !1, line: 146, type: !19)
!153 = !DILocation(line: 146, column: 12, scope: !143)
!154 = !DILocalVariable(name: "newsize", scope: !143, file: !1, line: 147, type: !19)
!155 = !DILocation(line: 147, column: 12, scope: !143)
!156 = !DILocation(line: 149, column: 10, scope: !157)
!157 = distinct !DILexicalBlock(scope: !143, file: !1, line: 149, column: 9)
!158 = !DILocation(line: 149, column: 9, scope: !143)
!159 = !DILocation(line: 149, column: 13, scope: !157)
!160 = !DILocation(line: 152, column: 9, scope: !161)
!161 = distinct !DILexicalBlock(scope: !143, file: !1, line: 152, column: 9)
!162 = !DILocation(line: 152, column: 12, scope: !161)
!163 = !DILocation(line: 152, column: 20, scope: !161)
!164 = !DILocation(line: 152, column: 23, scope: !161)
!165 = !DILocation(line: 152, column: 17, scope: !161)
!166 = !DILocation(line: 152, column: 9, scope: !143)
!167 = !DILocation(line: 153, column: 19, scope: !168)
!168 = distinct !DILexicalBlock(scope: !161, file: !1, line: 152, column: 30)
!169 = !DILocation(line: 153, column: 22, scope: !168)
!170 = !DILocation(line: 153, column: 29, scope: !168)
!171 = !DILocation(line: 153, column: 32, scope: !168)
!172 = !DILocation(line: 153, column: 27, scope: !168)
!173 = !DILocation(line: 153, column: 17, scope: !168)
!174 = !DILocation(line: 154, column: 29, scope: !175)
!175 = distinct !DILexicalBlock(scope: !168, file: !1, line: 154, column: 13)
!176 = !DILocation(line: 154, column: 32, scope: !175)
!177 = !DILocation(line: 154, column: 52, scope: !175)
!178 = !DILocation(line: 154, column: 50, scope: !175)
!179 = !DILocation(line: 154, column: 21, scope: !175)
!180 = !DILocation(line: 154, column: 19, scope: !175)
!181 = !DILocation(line: 154, column: 13, scope: !168)
!182 = !DILocation(line: 155, column: 13, scope: !175)
!183 = !DILocation(line: 156, column: 16, scope: !168)
!184 = !DILocation(line: 156, column: 9, scope: !168)
!185 = !DILocation(line: 156, column: 12, scope: !168)
!186 = !DILocation(line: 156, column: 14, scope: !168)
!187 = !DILocation(line: 157, column: 20, scope: !168)
!188 = !DILocation(line: 157, column: 9, scope: !168)
!189 = !DILocation(line: 157, column: 12, scope: !168)
!190 = !DILocation(line: 157, column: 18, scope: !168)
!191 = !DILocation(line: 158, column: 5, scope: !168)
!192 = !DILocation(line: 161, column: 9, scope: !143)
!193 = !DILocation(line: 161, column: 12, scope: !143)
!194 = !DILocation(line: 161, column: 16, scope: !143)
!195 = !DILocation(line: 161, column: 7, scope: !143)
!196 = !DILocation(line: 162, column: 15, scope: !143)
!197 = !DILocation(line: 162, column: 10, scope: !143)
!198 = !DILocation(line: 162, column: 5, scope: !143)
!199 = !DILocation(line: 162, column: 8, scope: !143)
!200 = !DILocation(line: 162, column: 13, scope: !143)
!201 = !DILocation(line: 163, column: 15, scope: !143)
!202 = !DILocation(line: 163, column: 18, scope: !143)
!203 = !DILocation(line: 163, column: 5, scope: !143)
!204 = !DILocation(line: 165, column: 5, scope: !143)
!205 = !DILocation(line: 166, column: 1, scope: !143)
!206 = distinct !DISubprogram(name: "bubble_up", scope: !1, file: !1, line: 87, type: !207, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !13, !19}
!209 = !DILocalVariable(name: "q", arg: 1, scope: !206, file: !1, line: 87, type: !13)
!210 = !DILocation(line: 87, column: 21, scope: !206)
!211 = !DILocalVariable(name: "i", arg: 2, scope: !206, file: !1, line: 87, type: !19)
!212 = !DILocation(line: 87, column: 31, scope: !206)
!213 = !DILocalVariable(name: "parent_node", scope: !206, file: !1, line: 89, type: !19)
!214 = !DILocation(line: 89, column: 12, scope: !206)
!215 = !DILocalVariable(name: "moving_node", scope: !206, file: !1, line: 90, type: !4)
!216 = !DILocation(line: 90, column: 11, scope: !206)
!217 = !DILocation(line: 90, column: 30, scope: !206)
!218 = !DILocation(line: 90, column: 25, scope: !206)
!219 = !DILocation(line: 90, column: 28, scope: !206)
!220 = !DILocalVariable(name: "moving_pri", scope: !206, file: !1, line: 91, type: !32)
!221 = !DILocation(line: 91, column: 18, scope: !206)
!222 = !DILocation(line: 91, column: 31, scope: !206)
!223 = !DILocation(line: 91, column: 34, scope: !206)
!224 = !DILocation(line: 91, column: 41, scope: !206)
!225 = !DILocation(line: 93, column: 24, scope: !226)
!226 = distinct !DILexicalBlock(scope: !206, file: !1, line: 93, column: 5)
!227 = !DILocation(line: 93, column: 22, scope: !226)
!228 = !DILocation(line: 93, column: 10, scope: !226)
!229 = !DILocation(line: 94, column: 12, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !1, line: 93, column: 5)
!231 = !DILocation(line: 94, column: 14, scope: !230)
!232 = !DILocation(line: 94, column: 19, scope: !230)
!233 = !DILocation(line: 94, column: 22, scope: !230)
!234 = !DILocation(line: 94, column: 25, scope: !230)
!235 = !DILocation(line: 94, column: 32, scope: !230)
!236 = !DILocation(line: 94, column: 35, scope: !230)
!237 = !DILocation(line: 94, column: 47, scope: !230)
!238 = !DILocation(line: 94, column: 42, scope: !230)
!239 = !DILocation(line: 94, column: 45, scope: !230)
!240 = !DILocation(line: 94, column: 62, scope: !230)
!241 = !DILocation(line: 93, column: 5, scope: !226)
!242 = !DILocation(line: 97, column: 24, scope: !243)
!243 = distinct !DILexicalBlock(scope: !230, file: !1, line: 96, column: 5)
!244 = !DILocation(line: 97, column: 19, scope: !243)
!245 = !DILocation(line: 97, column: 22, scope: !243)
!246 = !DILocation(line: 97, column: 14, scope: !243)
!247 = !DILocation(line: 97, column: 9, scope: !243)
!248 = !DILocation(line: 97, column: 12, scope: !243)
!249 = !DILocation(line: 97, column: 17, scope: !243)
!250 = !DILocation(line: 98, column: 9, scope: !243)
!251 = !DILocation(line: 98, column: 12, scope: !243)
!252 = !DILocation(line: 98, column: 24, scope: !243)
!253 = !DILocation(line: 98, column: 19, scope: !243)
!254 = !DILocation(line: 98, column: 22, scope: !243)
!255 = !DILocation(line: 98, column: 28, scope: !243)
!256 = !DILocation(line: 99, column: 5, scope: !243)
!257 = !DILocation(line: 95, column: 14, scope: !230)
!258 = !DILocation(line: 95, column: 12, scope: !230)
!259 = !DILocation(line: 95, column: 41, scope: !230)
!260 = !DILocation(line: 95, column: 39, scope: !230)
!261 = !DILocation(line: 93, column: 5, scope: !230)
!262 = distinct !{!262, !263}
!263 = !DILocation(line: 93, column: 5, scope: !206)
!264 = !DILocation(line: 101, column: 15, scope: !206)
!265 = !DILocation(line: 101, column: 10, scope: !206)
!266 = !DILocation(line: 101, column: 5, scope: !206)
!267 = !DILocation(line: 101, column: 8, scope: !206)
!268 = !DILocation(line: 101, column: 13, scope: !206)
!269 = !DILocation(line: 102, column: 5, scope: !206)
!270 = !DILocation(line: 102, column: 8, scope: !206)
!271 = !DILocation(line: 102, column: 15, scope: !206)
!272 = !DILocation(line: 102, column: 28, scope: !206)
!273 = !DILocation(line: 103, column: 1, scope: !206)
!274 = distinct !DISubprogram(name: "pqueue_change_priority", scope: !1, file: !1, line: 170, type: !275, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !13, !32, !4}
!277 = !DILocalVariable(name: "q", arg: 1, scope: !274, file: !1, line: 170, type: !13)
!278 = !DILocation(line: 170, column: 34, scope: !274)
!279 = !DILocalVariable(name: "new_pri", arg: 2, scope: !274, file: !1, line: 171, type: !32)
!280 = !DILocation(line: 171, column: 37, scope: !274)
!281 = !DILocalVariable(name: "d", arg: 3, scope: !274, file: !1, line: 172, type: !4)
!282 = !DILocation(line: 172, column: 30, scope: !274)
!283 = !DILocalVariable(name: "posn", scope: !274, file: !1, line: 174, type: !19)
!284 = !DILocation(line: 174, column: 12, scope: !274)
!285 = !DILocalVariable(name: "old_pri", scope: !274, file: !1, line: 175, type: !32)
!286 = !DILocation(line: 175, column: 18, scope: !274)
!287 = !DILocation(line: 175, column: 28, scope: !274)
!288 = !DILocation(line: 175, column: 31, scope: !274)
!289 = !DILocation(line: 175, column: 38, scope: !274)
!290 = !DILocation(line: 177, column: 5, scope: !274)
!291 = !DILocation(line: 177, column: 8, scope: !274)
!292 = !DILocation(line: 177, column: 15, scope: !274)
!293 = !DILocation(line: 177, column: 18, scope: !274)
!294 = !DILocation(line: 178, column: 12, scope: !274)
!295 = !DILocation(line: 178, column: 15, scope: !274)
!296 = !DILocation(line: 178, column: 22, scope: !274)
!297 = !DILocation(line: 178, column: 10, scope: !274)
!298 = !DILocation(line: 179, column: 9, scope: !299)
!299 = distinct !DILexicalBlock(scope: !274, file: !1, line: 179, column: 9)
!300 = !DILocation(line: 179, column: 12, scope: !299)
!301 = !DILocation(line: 179, column: 19, scope: !299)
!302 = !DILocation(line: 179, column: 28, scope: !299)
!303 = !DILocation(line: 179, column: 9, scope: !274)
!304 = !DILocation(line: 180, column: 19, scope: !299)
!305 = !DILocation(line: 180, column: 22, scope: !299)
!306 = !DILocation(line: 180, column: 9, scope: !299)
!307 = !DILocation(line: 182, column: 24, scope: !299)
!308 = !DILocation(line: 182, column: 27, scope: !299)
!309 = !DILocation(line: 182, column: 9, scope: !299)
!310 = !DILocation(line: 183, column: 1, scope: !274)
!311 = distinct !DISubprogram(name: "percolate_down", scope: !1, file: !1, line: 123, type: !207, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!312 = !DILocalVariable(name: "q", arg: 1, scope: !311, file: !1, line: 123, type: !13)
!313 = !DILocation(line: 123, column: 26, scope: !311)
!314 = !DILocalVariable(name: "i", arg: 2, scope: !311, file: !1, line: 123, type: !19)
!315 = !DILocation(line: 123, column: 36, scope: !311)
!316 = !DILocalVariable(name: "child_node", scope: !311, file: !1, line: 125, type: !19)
!317 = !DILocation(line: 125, column: 12, scope: !311)
!318 = !DILocalVariable(name: "moving_node", scope: !311, file: !1, line: 126, type: !4)
!319 = !DILocation(line: 126, column: 11, scope: !311)
!320 = !DILocation(line: 126, column: 30, scope: !311)
!321 = !DILocation(line: 126, column: 25, scope: !311)
!322 = !DILocation(line: 126, column: 28, scope: !311)
!323 = !DILocalVariable(name: "moving_pri", scope: !311, file: !1, line: 127, type: !32)
!324 = !DILocation(line: 127, column: 18, scope: !311)
!325 = !DILocation(line: 127, column: 31, scope: !311)
!326 = !DILocation(line: 127, column: 34, scope: !311)
!327 = !DILocation(line: 127, column: 41, scope: !311)
!328 = !DILocation(line: 129, column: 5, scope: !311)
!329 = !DILocation(line: 129, column: 35, scope: !311)
!330 = !DILocation(line: 129, column: 38, scope: !311)
!331 = !DILocation(line: 129, column: 26, scope: !311)
!332 = !DILocation(line: 129, column: 24, scope: !311)
!333 = !DILocation(line: 129, column: 42, scope: !311)
!334 = !DILocation(line: 130, column: 12, scope: !311)
!335 = !DILocation(line: 130, column: 15, scope: !311)
!336 = !DILocation(line: 130, column: 22, scope: !311)
!337 = !DILocation(line: 130, column: 34, scope: !311)
!338 = !DILocation(line: 130, column: 37, scope: !311)
!339 = !DILocation(line: 130, column: 49, scope: !311)
!340 = !DILocation(line: 130, column: 44, scope: !311)
!341 = !DILocation(line: 130, column: 47, scope: !311)
!342 = !DILocation(line: 132, column: 24, scope: !343)
!343 = distinct !DILexicalBlock(scope: !311, file: !1, line: 131, column: 5)
!344 = !DILocation(line: 132, column: 19, scope: !343)
!345 = !DILocation(line: 132, column: 22, scope: !343)
!346 = !DILocation(line: 132, column: 14, scope: !343)
!347 = !DILocation(line: 132, column: 9, scope: !343)
!348 = !DILocation(line: 132, column: 12, scope: !343)
!349 = !DILocation(line: 132, column: 17, scope: !343)
!350 = !DILocation(line: 133, column: 9, scope: !343)
!351 = !DILocation(line: 133, column: 12, scope: !343)
!352 = !DILocation(line: 133, column: 24, scope: !343)
!353 = !DILocation(line: 133, column: 19, scope: !343)
!354 = !DILocation(line: 133, column: 22, scope: !343)
!355 = !DILocation(line: 133, column: 28, scope: !343)
!356 = !DILocation(line: 134, column: 13, scope: !343)
!357 = !DILocation(line: 134, column: 11, scope: !343)
!358 = distinct !{!358, !328}
!359 = !DILocation(line: 137, column: 15, scope: !311)
!360 = !DILocation(line: 137, column: 10, scope: !311)
!361 = !DILocation(line: 137, column: 5, scope: !311)
!362 = !DILocation(line: 137, column: 8, scope: !311)
!363 = !DILocation(line: 137, column: 13, scope: !311)
!364 = !DILocation(line: 138, column: 5, scope: !311)
!365 = !DILocation(line: 138, column: 8, scope: !311)
!366 = !DILocation(line: 138, column: 15, scope: !311)
!367 = !DILocation(line: 138, column: 28, scope: !311)
!368 = !DILocation(line: 139, column: 1, scope: !311)
!369 = distinct !DISubprogram(name: "pqueue_remove", scope: !1, file: !1, line: 187, type: !144, isLocal: false, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!370 = !DILocalVariable(name: "q", arg: 1, scope: !369, file: !1, line: 187, type: !13)
!371 = !DILocation(line: 187, column: 25, scope: !369)
!372 = !DILocalVariable(name: "d", arg: 2, scope: !369, file: !1, line: 187, type: !4)
!373 = !DILocation(line: 187, column: 34, scope: !369)
!374 = !DILocalVariable(name: "posn", scope: !369, file: !1, line: 189, type: !19)
!375 = !DILocation(line: 189, column: 12, scope: !369)
!376 = !DILocation(line: 189, column: 19, scope: !369)
!377 = !DILocation(line: 189, column: 22, scope: !369)
!378 = !DILocation(line: 189, column: 29, scope: !369)
!379 = !DILocation(line: 190, column: 25, scope: !369)
!380 = !DILocation(line: 190, column: 28, scope: !369)
!381 = !DILocation(line: 190, column: 23, scope: !369)
!382 = !DILocation(line: 190, column: 18, scope: !369)
!383 = !DILocation(line: 190, column: 21, scope: !369)
!384 = !DILocation(line: 190, column: 10, scope: !369)
!385 = !DILocation(line: 190, column: 5, scope: !369)
!386 = !DILocation(line: 190, column: 8, scope: !369)
!387 = !DILocation(line: 190, column: 16, scope: !369)
!388 = !DILocation(line: 191, column: 9, scope: !389)
!389 = distinct !DILexicalBlock(scope: !369, file: !1, line: 191, column: 9)
!390 = !DILocation(line: 191, column: 12, scope: !389)
!391 = !DILocation(line: 191, column: 19, scope: !389)
!392 = !DILocation(line: 191, column: 22, scope: !389)
!393 = !DILocation(line: 191, column: 29, scope: !389)
!394 = !DILocation(line: 191, column: 33, scope: !389)
!395 = !DILocation(line: 191, column: 36, scope: !389)
!396 = !DILocation(line: 191, column: 48, scope: !389)
!397 = !DILocation(line: 191, column: 43, scope: !389)
!398 = !DILocation(line: 191, column: 46, scope: !389)
!399 = !DILocation(line: 191, column: 9, scope: !369)
!400 = !DILocation(line: 192, column: 19, scope: !389)
!401 = !DILocation(line: 192, column: 22, scope: !389)
!402 = !DILocation(line: 192, column: 9, scope: !389)
!403 = !DILocation(line: 194, column: 24, scope: !389)
!404 = !DILocation(line: 194, column: 27, scope: !389)
!405 = !DILocation(line: 194, column: 9, scope: !389)
!406 = !DILocation(line: 196, column: 5, scope: !369)
!407 = distinct !DISubprogram(name: "pqueue_pop", scope: !1, file: !1, line: 201, type: !408, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!408 = !DISubroutineType(types: !409)
!409 = !{!4, !13}
!410 = !DILocalVariable(name: "q", arg: 1, scope: !407, file: !1, line: 201, type: !13)
!411 = !DILocation(line: 201, column: 22, scope: !407)
!412 = !DILocalVariable(name: "head", scope: !407, file: !1, line: 203, type: !4)
!413 = !DILocation(line: 203, column: 11, scope: !407)
!414 = !DILocation(line: 205, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !407, file: !1, line: 205, column: 9)
!416 = !DILocation(line: 205, column: 12, scope: !415)
!417 = !DILocation(line: 205, column: 15, scope: !415)
!418 = !DILocation(line: 205, column: 18, scope: !415)
!419 = !DILocation(line: 205, column: 23, scope: !415)
!420 = !DILocation(line: 205, column: 9, scope: !407)
!421 = !DILocation(line: 206, column: 9, scope: !415)
!422 = !DILocation(line: 208, column: 12, scope: !407)
!423 = !DILocation(line: 208, column: 15, scope: !407)
!424 = !DILocation(line: 208, column: 10, scope: !407)
!425 = !DILocation(line: 209, column: 22, scope: !407)
!426 = !DILocation(line: 209, column: 25, scope: !407)
!427 = !DILocation(line: 209, column: 20, scope: !407)
!428 = !DILocation(line: 209, column: 15, scope: !407)
!429 = !DILocation(line: 209, column: 18, scope: !407)
!430 = !DILocation(line: 209, column: 5, scope: !407)
!431 = !DILocation(line: 209, column: 8, scope: !407)
!432 = !DILocation(line: 209, column: 13, scope: !407)
!433 = !DILocation(line: 210, column: 20, scope: !407)
!434 = !DILocation(line: 210, column: 5, scope: !407)
!435 = !DILocation(line: 212, column: 12, scope: !407)
!436 = !DILocation(line: 212, column: 5, scope: !407)
!437 = !DILocation(line: 213, column: 1, scope: !407)
!438 = distinct !DISubprogram(name: "pqueue_peek", scope: !1, file: !1, line: 217, type: !408, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!439 = !DILocalVariable(name: "q", arg: 1, scope: !438, file: !1, line: 217, type: !13)
!440 = !DILocation(line: 217, column: 23, scope: !438)
!441 = !DILocalVariable(name: "d", scope: !438, file: !1, line: 219, type: !4)
!442 = !DILocation(line: 219, column: 11, scope: !438)
!443 = !DILocation(line: 220, column: 10, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !1, line: 220, column: 9)
!445 = !DILocation(line: 220, column: 12, scope: !444)
!446 = !DILocation(line: 220, column: 15, scope: !444)
!447 = !DILocation(line: 220, column: 18, scope: !444)
!448 = !DILocation(line: 220, column: 23, scope: !444)
!449 = !DILocation(line: 220, column: 9, scope: !438)
!450 = !DILocation(line: 221, column: 9, scope: !444)
!451 = !DILocation(line: 222, column: 9, scope: !438)
!452 = !DILocation(line: 222, column: 12, scope: !438)
!453 = !DILocation(line: 222, column: 7, scope: !438)
!454 = !DILocation(line: 223, column: 12, scope: !438)
!455 = !DILocation(line: 223, column: 5, scope: !438)
!456 = !DILocation(line: 224, column: 1, scope: !438)
!457 = distinct !DISubprogram(name: "pqueue_dump", scope: !1, file: !1, line: 228, type: !458, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !13, !460, !521}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !462, line: 153, baseType: !463)
!462 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !462, line: 122, size: 1216, align: 64, elements: !464)
!464 = !{!465, !468, !469, !470, !472, !473, !478, !479, !480, !484, !490, !499, !505, !506, !509, !510, !514, !518, !519, !520}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !463, file: !462, line: 123, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !463, file: !462, line: 124, baseType: !31, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !463, file: !462, line: 125, baseType: !31, size: 32, align: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !463, file: !462, line: 126, baseType: !471, size: 16, align: 16, offset: 128)
!471 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !463, file: !462, line: 127, baseType: !471, size: 16, align: 16, offset: 144)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !463, file: !462, line: 128, baseType: !474, size: 128, align: 64, offset: 192)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !462, line: 88, size: 128, align: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !474, file: !462, line: 89, baseType: !466, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !474, file: !462, line: 90, baseType: !31, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !463, file: !462, line: 129, baseType: !31, size: 32, align: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !463, file: !462, line: 132, baseType: !4, size: 64, align: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !463, file: !462, line: 133, baseType: !481, size: 64, align: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!31, !4}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !463, file: !462, line: 134, baseType: !485, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!31, !4, !488, !31}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !463, file: !462, line: 135, baseType: !491, size: 64, align: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !4, !494, !31}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !462, line: 77, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !496, line: 71, baseType: !497)
!496 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/struewer/Downloads/libpqueue-master/src")
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !22, line: 46, baseType: !498)
!498 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !463, file: !462, line: 136, baseType: !500, size: 64, align: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!31, !4, !503, !31}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !463, file: !462, line: 139, baseType: !474, size: 128, align: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !463, file: !462, line: 140, baseType: !507, size: 64, align: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !462, line: 94, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !463, file: !462, line: 141, baseType: !31, size: 32, align: 32, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !463, file: !462, line: 144, baseType: !511, size: 24, align: 8, offset: 928)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 24, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 3)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !463, file: !462, line: 145, baseType: !515, size: 8, align: 8, offset: 952)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 8, align: 8, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 1)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !463, file: !462, line: 148, baseType: !474, size: 128, align: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !463, file: !462, line: 151, baseType: !31, size: 32, align: 32, offset: 1088)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !463, file: !462, line: 152, baseType: !494, size: 64, align: 64, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "pqueue_print_entry_f", file: !15, line: 53, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !460, !4}
!525 = !DILocalVariable(name: "q", arg: 1, scope: !457, file: !1, line: 228, type: !13)
!526 = !DILocation(line: 228, column: 23, scope: !457)
!527 = !DILocalVariable(name: "out", arg: 2, scope: !457, file: !1, line: 229, type: !460)
!528 = !DILocation(line: 229, column: 19, scope: !457)
!529 = !DILocalVariable(name: "print", arg: 3, scope: !457, file: !1, line: 230, type: !521)
!530 = !DILocation(line: 230, column: 34, scope: !457)
!531 = !DILocalVariable(name: "i", scope: !457, file: !1, line: 232, type: !31)
!532 = !DILocation(line: 232, column: 9, scope: !457)
!533 = !DILocation(line: 234, column: 13, scope: !457)
!534 = !DILocation(line: 234, column: 5, scope: !457)
!535 = !DILocation(line: 235, column: 12, scope: !536)
!536 = distinct !DILexicalBlock(scope: !457, file: !1, line: 235, column: 5)
!537 = !DILocation(line: 235, column: 10, scope: !536)
!538 = !DILocation(line: 235, column: 17, scope: !539)
!539 = distinct !DILexicalBlock(scope: !536, file: !1, line: 235, column: 5)
!540 = !DILocation(line: 235, column: 21, scope: !539)
!541 = !DILocation(line: 235, column: 24, scope: !539)
!542 = !DILocation(line: 235, column: 19, scope: !539)
!543 = !DILocation(line: 235, column: 5, scope: !536)
!544 = !DILocation(line: 236, column: 17, scope: !545)
!545 = distinct !DILexicalBlock(scope: !539, file: !1, line: 235, column: 35)
!546 = !DILocation(line: 238, column: 17, scope: !545)
!547 = !DILocation(line: 239, column: 17, scope: !545)
!548 = !DILocation(line: 239, column: 26, scope: !545)
!549 = !DILocation(line: 239, column: 36, scope: !545)
!550 = !DILocation(line: 240, column: 40, scope: !545)
!551 = !DILocation(line: 240, column: 43, scope: !545)
!552 = !DILocation(line: 240, column: 31, scope: !545)
!553 = !DILocation(line: 240, column: 17, scope: !545)
!554 = !DILocation(line: 236, column: 9, scope: !545)
!555 = !DILocation(line: 241, column: 9, scope: !545)
!556 = !DILocation(line: 241, column: 15, scope: !545)
!557 = !DILocation(line: 241, column: 25, scope: !545)
!558 = !DILocation(line: 241, column: 20, scope: !545)
!559 = !DILocation(line: 241, column: 23, scope: !545)
!560 = !DILocation(line: 242, column: 5, scope: !545)
!561 = !DILocation(line: 235, column: 31, scope: !539)
!562 = !DILocation(line: 235, column: 5, scope: !539)
!563 = distinct !{!563, !564}
!564 = !DILocation(line: 235, column: 5, scope: !457)
!565 = !DILocation(line: 243, column: 1, scope: !457)
!566 = distinct !DISubprogram(name: "maxchild", scope: !1, file: !1, line: 107, type: !567, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!567 = !DISubroutineType(types: !568)
!568 = !{!19, !13, !19}
!569 = !DILocalVariable(name: "q", arg: 1, scope: !566, file: !1, line: 107, type: !13)
!570 = !DILocation(line: 107, column: 20, scope: !566)
!571 = !DILocalVariable(name: "i", arg: 2, scope: !566, file: !1, line: 107, type: !19)
!572 = !DILocation(line: 107, column: 30, scope: !566)
!573 = !DILocalVariable(name: "child_node", scope: !566, file: !1, line: 109, type: !19)
!574 = !DILocation(line: 109, column: 12, scope: !566)
!575 = !DILocation(line: 109, column: 25, scope: !566)
!576 = !DILocation(line: 111, column: 9, scope: !577)
!577 = distinct !DILexicalBlock(scope: !566, file: !1, line: 111, column: 9)
!578 = !DILocation(line: 111, column: 23, scope: !577)
!579 = !DILocation(line: 111, column: 26, scope: !577)
!580 = !DILocation(line: 111, column: 20, scope: !577)
!581 = !DILocation(line: 111, column: 9, scope: !566)
!582 = !DILocation(line: 112, column: 9, scope: !577)
